---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures
source: html/ab2c0054-0141-7327-f1eb-180d1ba68745.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures

Failures about Matchline.

## Syntax (C#)
```csharp
public static class MatchlineFailures
```